#include <stdio.h>
#include <stdlib.h>
#include <memory.h>
#include <string.h>
#include "../des.h"


namespace toolHelp
{

// 初始置换表
const static char IP_Table[64] = {
	58, 50, 42, 34, 26, 18, 10, 2, 60, 52, 44, 36, 28, 20, 12, 4,
	62, 54, 46, 38, 30, 22, 14, 6, 64, 56, 48, 40, 32, 24, 16, 8,
	57, 49, 41, 33, 25, 17,  9, 1, 59, 51, 43, 35, 27, 19, 11, 3,
    61, 53, 45, 37, 29, 21, 13, 5, 63, 55, 47, 39, 31, 23, 15, 7
};

// 逆初始置换表
const static char IPR_Table[64] = {
	40, 8, 48, 16, 56, 24, 64, 32, 39, 7, 47, 15, 55, 23, 63, 31,
	38, 6, 46, 14, 54, 22, 62, 30, 37, 5, 45, 13, 53, 21, 61, 29,
    36, 4, 44, 12, 52, 20, 60, 28, 35, 3, 43, 11, 51, 19, 59, 27,
	34, 2, 42, 10, 50, 18, 58, 26, 33, 1, 41,  9, 49, 17, 57, 25
};

// 扩展置换表
static const char Extension_Table[48] = {
	32,  1,  2,  3,  4,  5,  4,  5,  6,  7,  8,  9,
	 8,  9, 10, 11, 12, 13, 12, 13, 14, 15, 16, 17,
	16, 17, 18, 19, 20, 21, 20, 21, 22, 23, 24, 25,
	24, 25, 26, 27, 28, 29, 28, 29, 30, 31, 32,  1
};

// P盒置换表
const static char P_Table[32] = {
	16, 7, 20, 21, 29, 12, 28, 17, 1,  15, 23, 26, 5,  18, 31, 10,
	2,  8, 24, 14, 32, 27, 3,  9,  19, 13, 30, 6,  22, 11, 4,  25
};

// 密钥置换表 
const static char PCK_Table[56] = {
	57, 49, 41, 33, 25, 17,  9,  1, 58, 50, 42, 34, 26, 18,
	10,  2, 59, 51, 43, 35, 27, 19, 11,  3, 60, 52, 44, 36,
	63, 55, 47, 39, 31, 23, 15,  7, 62, 54, 46, 38, 30, 22,
	14,  6, 61, 53, 45, 37, 29, 21, 13,  5, 28, 20, 12,  4
};

// 压缩置换表 
const static char PCC_Table[48] = {
	14, 17, 11, 24,  1,  5,  3, 28, 15,  6, 21, 10,
	23, 19, 12,  4, 26,  8, 16,  7, 27, 20, 13,  2,
	41, 52, 31, 37, 47, 55, 30, 40, 51, 45, 33, 48,
	44, 49, 39, 56, 34, 53, 46, 42, 50, 36, 29, 32
};

// 每轮移动的位数 
const static char LOOP_Table[16] = {
	1,1,2,2,2,2,2,2,1,2,2,2,2,2,2,1
};

// S盒设计
const static char S_Box[8][4][16] = {
	// S盒1 
    {
        {14, 4,	13,	 1,  2, 15, 11,  8,  3, 10,  6, 12,  5,  9,  0,  7},
        {0, 15,  7,  4, 14,  2, 13,  1, 10,  6, 12, 11,  9,  5,  3,  8},
        {4,  1, 14,  8, 13,  6,  2, 11, 15, 12,  9,  7,  3, 10,  5,  0},
        {15, 12,  8,  2,  4,  9,  1,  7,  5, 11,  3, 14, 10,  0,  6, 13}
    },

	// S盒2 
    {
        {15,  1,  8, 14,  6, 11,  3,  4,  9,  7,  2, 13, 12,  0,  5, 10},
        {3, 13,  4,  7, 15,  2,  8, 14, 12,  0,  1, 10,  6,  9, 11,  5},
        {0, 14,  7, 11, 10,  4, 13,  1,  5,  8, 12,  6,  9,  3,  2, 15},
        {13,  8, 10,  1,  3, 15,  4,  2, 11,  6,  7, 12,  0,  5, 14,  9}
    },

	// S盒3 
    {
        {10,  0,  9, 14,  6,  3, 15,  5,  1, 13, 12,  7, 11,  4,  2,  8},
        {13,  7,  0,  9,  3,  4,  6, 10,  2,  8,  5, 14, 12, 11, 15,  1},
        {13,  6,  4,  9,  8, 15,  3,  0, 11,  1,  2, 12,  5, 10, 14,  7},
        {1, 10, 13,  0,  6,  9,  8,  7,  4, 15, 14,  3, 11,  5,  2, 12}
    },

	// S盒4 
    {
        {7, 13, 14,  3,  0,  6,  9, 10,  1,  2,  8,  5, 11, 12,  4, 15},
        {13,  8, 11,  5,  6, 15,  0,  3,  4,  7,  2, 12,  1, 10, 14,  9},
        {10,  6,  9,  0, 12, 11,  7, 13, 15,  1,  3, 14,  5,  2,  8,  4},
        {3, 15,  0,  6, 10,  1, 13,  8,  9,  4,  5, 11, 12,  7,  2, 14}
    },

	// S盒5 
    {
        {2, 12,  4,  1,  7, 10, 11,  6,  8,  5,  3, 15, 13,  0, 14,  9},
        {14, 11,  2, 12,  4,  7, 13,  1,  5,  0, 15, 10,  3,  9,  8,  6},
        {4,  2,  1, 11, 10, 13,  7,  8, 15,  9, 12,  5,  6,  3,  0, 14},
        {11,  8, 12,  7,  1, 14,  2, 13,  6, 15,  0,  9, 10,  4,  5,  3}
    },

	// S盒6 
    {
        {12,  1, 10, 15,  9,  2,  6,  8,  0, 13,  3,  4, 14,  7,  5, 11},
        {10, 15,  4,  2,  7, 12,  9,  5,  6,  1, 13, 14,  0, 11,  3,  8},
        {9, 14, 15,  5,  2,  8, 12,  3,  7,  0,  4, 10,  1, 13, 11,  6},
        {4,  3,  2, 12,  9,  5, 15, 10, 11, 14,  1,  7,  6,  0,  8, 13}
    },

	// S盒7 
    {
        {4, 11,  2, 14, 15,  0,  8, 13,  3, 12,  9,  7,  5, 10,  6,  1},
        {13,  0, 11,  7,  4,  9,  1, 10, 14,  3,  5, 12,  2, 15,  8,  6},
        {1,  4, 11, 13, 12,  3,  7, 14, 10, 15,  6,  8,  0,  5,  9,  2},
        {6, 11, 13,  8,  1,  4, 10,  7,  9,  5,  0, 15, 14,  2,  3, 12}
    },

	// S盒8 
    {
        {13,  2,  8,  4,  6, 15, 11,  1, 10,  9,  3, 14,  5,  0, 12,  7},
        {1, 15, 13,  8, 10,  3,  7,  4, 12,  5,  6, 11,  0, 14,  9,  2},
        {7, 11,  4,  1,  9, 12, 14,  2,  0,  6, 10, 13, 15,  3,  5,  8},
        {2,  1, 14,  7,  4, 10,  8, 13, 15, 12,  9,  0,  3,  5,  6, 11}
    }

};

CDes::CDes()
{
    memset(SubKey,0,sizeof(SubKey));
    memset(deskey,0,16);
    Is3DES = false;
}

// 字节转换函数
void CDes::ByteToBit(bool *Out, const char *In, int bits)
{
    for(int i=0; i<bits; ++i)
        Out[i] = (In[i>>3]>>(i&7)) & 1;
}

// 比特转换函数
void CDes::BitToByte(char *Out, const bool *In, int bits)
{
    memset(Out, 0, bits>>3);
    for(int i=0; i<bits; ++i)
        Out[i>>3] |= In[i]<<(i&7);
}


// 变换函数
void CDes::Transform(bool *Out, bool *In, const char *Table, int len)
{
    bool Tmp[128];

    for(int i=0; i<len; ++i)
        Tmp[i] = In[ Table[i]-1 ];
    memcpy(Out, Tmp, len);
}

// 异或函数的实现
void CDes::Xor(bool *InA, const bool *InB, int len)
{
    for(int i=0; i<len; ++i)
        InA[i] ^= InB[i];
}

// 轮转函数
void CDes::RotateL(bool *In, int len, int loop)
{
    char Tmp[256];

    memcpy(Tmp, In, loop);
    memcpy(In, In+loop, len-loop);
    memcpy(In+len-loop, Tmp, loop);
}

/******************************************************************************/
//	名称：S_func
//	功能：S 盒代替
//  参数：
//	返回：
//  备注：私有函数，不用检查指针是否为空

/******************************************************************************/
void CDes::S_func(bool Out[32], const bool In[48])
{
    for(int i=0,j,k; i<8; ++i,In+=6,Out+=4) 
    {
        j = (In[0]<<1) + In[5];
        k = (In[1]<<3) + (In[2]<<2) + (In[3]<<1) + In[4];
		ByteToBit(Out, &S_Box[i][j][k], 4);
    }
}

/******************************************************************************/
//	名称：F_func
//	功能：f 函数
//  参数：
//	返回：
//  备注：私有函数，不用检查指针是否为空

/******************************************************************************/
void CDes::F_func(bool In[32], const bool Ki[48])
{
    bool MR[48];

    Transform(MR, In, Extension_Table, 48);
    Xor(MR, Ki, 48);
    S_func(In, MR);

    Transform(In, In, P_Table, 32);
}



/******************************************************************************/
//	名称：SetSubKey
//	功能：由输入密钥设置16圈子密钥
//  参数：
//	返回：
//  备注：私有函数，不用检查指针是否为空

/******************************************************************************/
void CDes::SetSubKey(PSubKey pSubKey, const char Key[8])
{
    //static bool K[64], *KL=&K[0], *KR=&K[28];
    bool K[64], *KL=&K[0], *KR=&K[28];

    // 将密钥字节组分解成密钥位组
    ByteToBit(K, Key, 64); 
    // 密钥变换
    Transform(K, K, PCK_Table, 56); 

	//由56位密钥产生48位子密钥
    for(int i=0; i<16; ++i) 
    {
        // 循环左移
        RotateL(KL, 28, LOOP_Table[i]);
        RotateL(KR, 28, LOOP_Table[i]);

        // 压缩变换
        Transform((*pSubKey)[i], K, PCC_Table, 48); 
    }
}


/******************************************************************************/
//	名称：SetSubKey
//	功能：由输入密钥串设置子密钥
//  参数：KeyStr为0结尾的密钥串，长度<=16，可为任意字符
//	返回：设置成功返回true，否则返回false
//  备注：当密钥长度>8时，将设置第2密钥，且置3次DES标志
//        密钥长度大于16时，只取前16位

/******************************************************************************/
void CDes::SetSubKey(const char* KeyStr)
{
    //保存密钥(超过16，只保存前16位)
    int len = strlen(KeyStr);
    len = (len > 16) ? 16 : len;
	memset(deskey, 0, 16);
	memcpy(deskey, KeyStr, len);

    //设置第1密钥
	SetSubKey(&SubKey[0], &deskey[0]);

    Is3DES = false;
    if(len > 8)
    {
        //置3次DES标志
        Is3DES = true;

        //设置第2密钥
        SetSubKey(&SubKey[1], &deskey[8]);
    }
}

/******************************************************************************/
//	名称：RandKeyStr
//	功能：产生随机密钥串
//  参数：
//	返回：KeyStr地址

/******************************************************************************/
char* CDes::RandKeyStr(char KeyStr[9])
{
    //产生随机数
    srand(rand());
    for(int i=0; i<8; ++i)
    {
        KeyStr[i] = rand()%256;
    }

    while( !( KeyStr[7] && 0xf0 ) )
        KeyStr[7] = rand()%256;

    KeyStr[8] = '\0';

    // 这样可以进行连接操作
    return KeyStr;
}


/******************************************************************************/
//	名称：DES
//	功能：加/解密
//  参数：Type—ENCRYPT:加密,DECRYPT:解密
//	返回：
//  备注：私有函数，不用检查指针是否为空

/******************************************************************************/
void CDes::DES(char Out[8], char In[8], const PSubKey pSubKey, bool Type)
{
    //static bool M[64], tmp[32], *Li=&M[0], *Ri=&M[32];
    bool M[64], tmp[32], *Li=&M[0], *Ri=&M[32];

    //将输入字节组分解成位组
    ByteToBit(M, In, 64);
    //初始变换
    Transform(M, M, IP_Table, 64);

    if( Type == ENCRYPT )  //加密变换
    {
        for(int i=0; i<16; ++i)
        {
            memcpy(tmp, Ri, 32);
            F_func(Ri, (*pSubKey)[i]); // 调用F函数
            Xor(Ri, Li, 32);
            memcpy(Li, tmp, 32);
        }
    }
    else  //解密变换
    {
        for(int i=15; i>=0; --i)
        {
            memcpy(tmp, Li, 32);
            F_func(Li, (*pSubKey)[i]);
            Xor(Li, Ri, 32);
            memcpy(Ri, tmp, 32);
        }
	}
    Transform(M, M, IPR_Table, 64);
    BitToByte(Out, M, 64);
}

/******************************************************************************/
//	名称：Encrypt
//	功能：加密
//  参数：len—数据长度，必须是8的倍数；KeyStr为0结尾的密钥串，长度<=16，可为任意字符
//        KeyStr默认值为0，如果你在调用前设置过子密钥，则可省略该参数。例:
//        SetSubKey(KeyStr);Encrypt(data,data,len);或:Encrypt(data,data,len,KeyStr);
//	返回：加密成功返回true，否则返回false
//  备注：当密钥长度>8时，系统自动使用3次DES加密

/******************************************************************************/
bool  CDes::Encrypt(char *Out,char *In,int len,const char *KeyStr) //加密
{
    if( !( Out != NULL && In != NULL && KeyStr != NULL) ) 
    {
        return false;
    }

	SetSubKey(KeyStr);

    if( !Is3DES)  //1次DES
    {
         for(int i=0,j=len>>3; i<j; ++i)
         {
             DES(Out,In,&SubKey[0], ENCRYPT);
             Out += 8; In  += 8;
         }
    }
    else
	{   // 3次DES E-D-E
        for(int i=0,j=len>>3; i<j; ++i)
        {
            DES(Out,In, &SubKey[0],ENCRYPT);
            DES(Out,Out,&SubKey[1],DECRYPT);
            DES(Out,Out,&SubKey[0],ENCRYPT);
            Out += 8; In += 8;
		}
    }

    return true;
}

/******************************************************************************/
//	名称：Decrypt
//	功能：解密
//  参数：len—数据长度，必须是8的倍数；KeyStr为0结尾的密钥串，长度<=16，可为任意字符
//        KeyStr默认值为0，如果你在调用前设置过子密钥，则可省略该参数。例:
//        SetSubKey(KeyStr);Decrypt(data,data,len);或:Decrypt(data,data,len,KeyStr);
//	返回：解密成功返回true，否则返回false
//  备注：当密钥长度>8时，系统自动使用3次DES解密

/******************************************************************************/
bool  CDes::Decrypt(char *Out,char *In,int len,const char *KeyStr) //解密
{
    if( !( Out != NULL && In != NULL && KeyStr != NULL) ) 
    {
        return false;
    }
    
	SetSubKey(KeyStr);

    if( !Is3DES )
    {   // 1次DES
        for(int i=0,j=len>>3; i<j; ++i)
        {
            DES(Out,In,&SubKey[0],DECRYPT);
            Out += 8; In += 8;
        }
    }
    else
    {   // 3次DES D-E-D
        for(int i=0,j=len>>3; i<j; ++i)
        {
            DES(Out,In, &SubKey[0],DECRYPT);
            DES(Out,Out,&SubKey[1],ENCRYPT);
            DES(Out,Out,&SubKey[0],DECRYPT);
            Out += 8; In += 8;
        }
    }
    
	return true;
}


}




